app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save
---
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ghdf"], ["user_id", 1], ["room_id", 1], ["created_at", "2022-11-08 09:52:56.237725"], ["updated_at", "2022-11-08 09:52:56.237725"]]